xcweaver/socialnetwork/evaluation/gcp/2024-08-13_00:22:16/workload.out
Running 5m test @ http://34.159.181.82:12345/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 15.368ms, rate sampling interval: 42ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    17.73ms    8.78ms  38.72ms   94.24%
    Req/Sec     9.83     14.82    48.00     93.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.01ms
 75.000%   18.37ms
 90.000%   22.40ms
 99.000%   38.72ms
 99.900%  158.72ms
 99.990%  235.13ms
 99.999%  235.13ms
100.000%  235.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.895     0.000000            1         1.00
      13.695     0.100000          290         1.11
      14.311     0.200000          579         1.25
      14.871     0.300000          870         1.43
      15.431     0.400000         1154         1.67
      16.015     0.500000         1443         2.00
      16.375     0.550000         1586         2.22
      16.767     0.600000         1730         2.50
      17.279     0.650000         1875         2.86
      17.727     0.700000         2018         3.33
      18.367     0.750000         2163         4.00
      18.751     0.775000         2234         4.44
      19.183     0.800000         2307         5.00
      19.711     0.825000         2378         5.71
      20.415     0.850000         2450         6.67
      21.215     0.875000         2523         8.00
      21.743     0.887500         2558         8.89
      22.399     0.900000         2594        10.00
      23.087     0.912500         2630        11.43
      24.159     0.925000         2666        13.33
      25.951     0.937500         2702        16.00
      26.735     0.943750         2720        17.78
      27.791     0.950000         2738        20.00
      28.415     0.956250         2756        22.86
      29.551     0.962500         2774        26.67
      30.575     0.968750         2792        32.00
      31.375     0.971875         2801        35.56
      32.143     0.975000         2810        40.00
      33.375     0.978125         2819        45.71
      34.687     0.981250         2829        53.33
      35.711     0.984375         2837        64.00
      36.383     0.985938         2842        71.11
      37.087     0.987500         2846        80.00
      38.175     0.989062         2851        91.43
      40.735     0.990625         2855       106.67
      41.823     0.992188         2860       128.00
      42.847     0.992969         2862       142.22
      45.567     0.993750         2864       160.00
      47.167     0.994531         2867       182.86
      48.575     0.995313         2869       213.33
      49.311     0.996094         2871       256.00
      51.007     0.996484         2872       284.44
      51.295     0.996875         2873       320.00
      54.431     0.997266         2875       365.71
      59.615     0.997656         2876       426.67
      63.103     0.998047         2877       512.00
      63.103     0.998242         2877       568.89
     105.023     0.998437         2878       640.00
     158.719     0.998633         2879       731.43
     158.719     0.998828         2879       853.33
     210.303     0.999023         2880      1024.00
     210.303     0.999121         2880      1137.78
     210.303     0.999219         2880      1280.00
     216.063     0.999316         2881      1462.86
     216.063     0.999414         2881      1706.67
     216.063     0.999512         2881      2048.00
     216.063     0.999561         2881      2275.56
     216.063     0.999609         2881      2560.00
     235.135     0.999658         2882      2925.71
     235.135     1.000000         2882          inf
#[Mean    =       17.725, StdDeviation   =        8.782]
#[Max     =      235.008, Total count    =         2882]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3000 requests in 5.00m, 1.47MB read
Requests/sec:     10.00
Transfer/sec:      5.03KB
